app/controllers/doctors_controller.rb

  def show
    @doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("created_at", "full_name", "specialization_id", "time_limit", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 08 Dec 2012 12:01:37 UTC +00:00], ["full_name", "Petrov S. A."], ["specialization_id", 1], ["time_limit", 15], ["updated_at", Sat, 08 Dec 2012 12:01:37 UTC +00:00]]

  def update
    @doctor = Doctor.find(params[:id])

    respond_to do |format|
      if @doctor.update_attributes(params[:doctor])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "doctors" SET "full_name" = 'Petrov S.A.', "updated_at" = '2012-12-08 12:12:21.384639' WHERE "doctors"."id" = 2