app/controllers/specializations_controller.rb

SELECT "specializations".* FROM "specializations"
---
  def index
    @specializations = Specialization.all

SELECT "specializations".* FROM "specializations" WHERE "specializations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @specialization = Specialization.find(params[:id])

INSERT INTO "specializations" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 09 Dec 2012 14:12:18 UTC +00:00], ["name", "Therapists"], ["updated_at", Sun, 09 Dec 2012 14:12:18 UTC +00:00]]
---
  def create
    @specialization = Specialization.new(params[:specialization])

    respond_to do |format|
      if @specialization.save