app/controllers/tickets_controller.rb

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "19"]]

  def create
    if session[:user_id] != nil
      @ticket = Ticket.new(params[:ticket])

      respond_to do |format|
        if @ticket.save
---
INSERT INTO "tickets" ("created_at", "date", "doctor_name", "duration", "state", "time", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "19"]]
UPDATE "tickets" SET "user_name" = 'Krukovets Yana', "time" = '16:30', "state" = 'otlichnoe', "duration" = 15, "date" = '5/12/2012', "updated_at" = '2012-12-05 08:47:24.702808' WHERE "tickets"."id" = 19

  def destroy
  if session[:user_id] != nil
    @ticket = Ticket.find(params[:id])
    @ticket.destroy
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 3]]