app/controllers/ticket_statuses_controller.rb

  def index
    @ticket_statuses = TicketStatus.all
---
SELECT "ticket_statuses".* FROM "ticket_statuses"