app/controllers/users_statuses_controller.rb

SELECT "users_statuses".* FROM "users_statuses"
---
  def index
    @users_statuses = UsersStatus.all