app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "fio", "login", "password", "statusId", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 09 Dec 2012 14:13:31 UTC +00:00], ["fio", "Kulishov Mark"], ["login", "mark"], ["password", "123"], ["statusId", 1], ["updated_at", Sun, 09 Dec 2012 14:13:31 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save