app/controllers/work_days_controller.rb

SELECT "work_days".* FROM "work_days"
---
  def index
    @work_days = WorkDay.all

SELECT "work_days".* FROM "work_days" WHERE "work_days"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @work_day = WorkDay.find(params[:id])

SELECT "work_days".* FROM "work_days" WHERE "work_days"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @work_day = WorkDay.find(params[:id])

INSERT INTO "work_days" ("created_at", "doctor_full_name", "duration", "time", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @work_day = WorkDay.new(params[:work_day])

    respond_to do |format|
      if @work_day.save