app/controllers/working_timetables_controller.rb

  def index
    @working_timetables = WorkingTimetable.all
---
SELECT "working_timetables".* FROM "working_timetables"

  def show
    @working_timetable = WorkingTimetable.find(params[:id])
---
SELECT "working_timetables".* FROM "working_timetables" WHERE "working_timetables"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @working_timetable = WorkingTimetable.new(params[:working_timetable])

    respond_to do |format|
      if @working_timetable.save
---
INSERT INTO "working_timetables" ("created_at", "doctorId", "updated_at", "workingTimeHash") VALUES (?, ?, ?, ?)